Repository: Hikki-dev/Buslink
Catalog: lib/l10n/app_*.arb
Languages: si, ta

source: Generate Report
si: වාර්තාව උත්පාදනය කරන්න
ta: அறிக்கையை உருவாக்கவும்

source: Dashboard
si: ඩෑෂ්බෝඩ්
ta: டாஷ்போர்டு

source: Revenue
si: ආදායම
ta: வருவாய்

source: Late Departures
si: ප්‍රමාද වී පිටත්වීම්
ta: தாமதமான புறப்பாடுகள்

source: Search
si: සොයන්න
ta: தேடு

source: Date
si: දිනය
ta: தேதி

source: Save
si: සුරකින්න
ta: சேமி

source: Language
si: භාෂාව
ta: மொழி

source: English
si: ඉංග්‍රීසි
ta: ஆங்கிலம்

source: Sinhala
si: සිංහල
ta: சிங்களம்

source: Tamil
si: දෙමළ
ta: தமிழ்

source: Select Language
si: භාෂාව තෝරන්න
ta: மொழியைத் தேர்ந்தெடுக்கவும்

source: Log In
si: පිවිසෙන්න
ta: உள்நுழைக

source: Home
si: මුල් පිටුව
ta: முகப்பு

source: Trips
si: ගමන්
ta: பயணங்கள்

source: Routes
si: මාර්ග
ta: வழிகள்

source: Bookings
si: වෙන් කිරීම්
ta: முன்பதிவுகள்

source: Refunds
si: ආපසු ගෙවීම්
ta: திரும்பப்பெறுதல்

source: Feedback
si: ප්‍රතිචාර
ta: கருத்து

source: Profile
si: පැතිකඩ
ta: சுயவிவரம்

source: Log Out
si: ඉවත් වන්න
ta: வெளியேறு

# enterOriginDestination
source: Please enter origin and destination
si: කරුණාකර ආරම්භක සහ ගමනාන්තය ඇතුළත් කරන්න
ta: தயவுசெய்து ஆரம்ப மற்றும் சேருமிடத்தை உள்ளிடவும்

source: Your Favorites
si: ඔබගේ ප්‍රියතම
ta: உங்கள் விருப்பங்கள்

source: Tap to quick book
si: ඉක්මන් වෙන් කිරීමට ඔබන්න
ta: விரைவாக பதிவு செய்ய தட்டவும்

source: Management
si: කළමනාකරණය
ta: மேலாண்மை

# manageSubtitle
source: Manage your routes, trips, and bookings.
si: ඔබේ මාර්ග, ගමන් සහ වෙන් කිරීම් කළමනාකරණය කරන්න.
ta: உங்கள் வழிகள், பயணங்கள் மற்றும் முன்பதிவுகளை நிர்வகிக்கவும்.

# addTrip
source: Add New Trip
si: නව ගමනක් එක් කරන්න
ta: புதிய பயணத்தைச் சேர்க்கவும்

source: Add Route
si: මාර්ගයක් එක් කරන්න
ta: வழியைச் சேர்க்கவும்

source: Manage Routes
si: මාර්ග කළමනාකරණය
ta: வழிகளை நிர்வகி

source: Analytics
si: විශ්ලේෂණ
ta: பகுப்பாய்வு

source: Refine Date
si: දිනය වෙනස් කරන්න
ta: தேதியை மாற்றவும்

source: Last 7 Days
si: පසුගිය දින 7
ta: கடந்த 7 நாட்கள்

source: Last 30 Days
si: පසුගිය දින 30
ta: கடந்த 30 நாட்கள்

source: This Month
si: මෙම මාසය
ta: இந்த மாதம்

source: Quick Select
si: ඉක්මන් තේරීම
ta: விரைவுத் தேர்வு

source: Net Revenue Over Time
si: කාලයත් සමඟ ශුද්ධ ආදායම
ta: காலப்போக்கில் நிகர வருவாய்

# topRoutesRevenue
source: Top Routes by Net Revenue
si: ශුද්ධ ආදායම අනුව ඉහළම මාර්ග
ta: நிகர வருவாய் மூலம் சிறந்த வழிகள்

source: Net Revenue (30d)
si: ශුද්ධ ආදායම (දින 30)
ta: நிகர வருவாய் (30 நாட்கள்)

source: Net Revenue (Today)
si: ශුද්ධ ආදායම (අද)
ta: நிகர வருவாய் (இன்று)

# noRevenueData
source: No revenue data for this period
si: මෙම කාල සීමාව සඳහා ආදායම් දත්ත නොමැත
ta: இந்த காலத்திற்கான வருவாய் தரவு இல்லை

# noRouteData
source: No route data available
si: මාර්ග දත්ත නොමැත
ta: வழித் தரவு இல்லை

source: Daily
si: දිනපතා
ta: தினசரி

source: Monthly
si: මාස්පතා
ta: மாதாந்திர

source: Yearly
si: වාර්ෂිකව
ta: வருடாந்திர

# searchRouteHint
source: Search Route (e.g. Colombo)
si: මාර්ගය සොයන්න (උදා: කොළඹ)
ta: வழியைத் தேடுங்கள் (எ.கா. கொழும்பு)

source: Punctuality Overview
si: කාල වේලාව පිළිබඳ දළ විශ්ලේෂණය
ta: காலவறையறை கண்ணோட்டம்

source: High Delay Trips
si: වැඩි ප්‍රමාද වූ ගමන්
ta: அதிக தாமதமான பயணங்கள்

source: Total Trips
si: මුළු ගමන්
ta: மொத்த பயணங்கள்

source: Late Rate
si: ප්‍රමාද වීමේ අනුපාතය
ta: தாமத விகிதம்

source: No Data
si: දත්ත නොමැත
ta: தரவு இல்லை

source: On Time
si: නියමිත වේලාවට
ta: சரியான நேரத்தில்

source: Late
si: ප්‍රමාදයි
ta: தாமதமானது

source: No significant delays.
si: සැලකිය යුතු ප්‍රමාදයන් නොමැත.
ta: குறிப்பிடத்தக்க தாமதங்கள் இல்லை.

source: Select Month
si: මාසය තෝරන්න
ta: மாதத்தைத் தேர்ந்தெடுக்கவும்

source: Select Year
si: වර්ෂය තෝරන්න
ta: ஆண்டைத் தேர்ந்தெடுக்கவும்

source: Cancel
si: අවලංගු කරන්න
ta: ரத்துசெய்

source: OK
si: හරි
ta: சரி

# loginErrorEmpty
source: Email and Password cannot be empty.
si: විද්‍යුත් තැපෑල සහ මුරපදය හිස්ව තැබිය නොහැක.
ta: மின்னஞ்சல் மற்றும் கடவுச்சொல் காலியாக இருக்கக்கூடாது.

source: Welcome!
si: ආයුබෝවන්!
ta: வரவேற்கிறோம்!

# loginSubtitle
source: Log in to BusLink to continue.
si: ඉදිරියට යාමට BusLink වෙත පිවිසෙන්න.
ta: தொடர BusLink இல் உள்நுழையவும்.

# signupSubtitle
source: Join us and start your journey today.
si: අප හා එක් වී ඔබගේ ගමන අදම අරඹන්න.
ta: எங்களுடன் இணைந்து உங்கள் பயணத்தை இன்றே தொடங்குங்கள்.

source: Continue with Google
si: Google සමඟ ඉදිරියට යන්න
ta: Google உடன் தொடரவும்

# orDivider
source: OR
si: හෝ
ta: அல்லது

source: Full Name
si: සම්පූර්ණ නම
ta: முழு பெயர்

# enterFullName
source: Enter your full name
si: ඔබගේ සම්පූර්ණ නම ඇතුළත් කරන්න
ta: உங்கள் முழு பெயரை உள்ளிடவும்

# nameRequired
source: Name is required
si: නම අනිවාර්ය වේ
ta: பெயர் அவசியம்

# nameInvalid
source: Enter a valid name (Alphabets only)
si: වලංගු නමක් ඇතුළත් කරන්න (අක්ෂර පමණි)
ta: செல்லுபடியாகும் பெயரை உள்ளிடவும் (எழுத்துக்கள் மட்டும்)

source: Name too short
si: නම කෙටි වැඩිය
ta: பெயர் மிகவும் குறுகியது

source: Email
si: විද්‍යුත් තැපෑල
ta: மின்னஞ்சல்

# enterEmail
source: Your email address
si: ඔබගේ විද්‍යුත් තැපැල් ලිපිනය
ta: உங்கள் மின்னஞ்சல் முகவரி

# emailRequired
source: Email is required
si: විද්‍යුත් තැපෑල අනිවාර්ය වේ
ta: மின்னஞ்சல் அவசியம்

# emailInvalid
source: Enter a valid email address
si: වලංගු විද්‍යුත් තැපැල් ලිපිනයක් ඇතුළත් කරන්න
ta: செல்லுபடியாகும் மின்னஞ்சல் முகவரியை உள்ளிடவும்

source: Password
si: මුරපදය
ta: கடவுச்சொல்

# enterPassword
source: Your password
si: ඔබගේ මුරපදය
ta: உங்கள் கடவுச்சொல்

# passwordLengthError
source: Password must be at least 6 characters
si: මුරපදය අවම වශයෙන් අක්ෂර 6ක් විය යුතුය
ta: கடவுச்சொல் குறைந்தது 6 எழுத்துக்களாக இருக்க வேண்டும்

source: Confirm Password
si: මුරපදය තහවුරු කරන්න
ta: கடவுச்சொல்லை உறுதிப்படுத்தவும்

# reenterPassword
source: Re-enter your password
si: ඔබගේ මුරපදය නැවත ඇතුළත් කරන්න
ta: உங்கள் கடவுச்சொல்லை மீண்டும் உள்ளிடவும்

# confirmPasswordRequired
source: Please confirm your password
si: කරුණාකර ඔබගේ මුරපදය තහවුරු කරන්න
ta: தயவுசெய்து உங்கள் கடவுச்சொல்லை உறுதிப்படுத்தவும்

source: Passwords do not match
si: මුරපද නොගැලපේ
ta: கடவுச்சொற்கள் பொருந்தவில்லை

source: Forgot Password?
si: මුරපදය අමතකද?
ta: கடவுச்சொல்லை மறந்துவிட்டீர்களா?

source: Sign Up
si: ලියාපදිංචි වන්න
ta: பதிவு செய்யவும்

# noAccount
source: Don't have an account?
si: ගිණුමක් නොමැතිද?
ta: கணக்கு இல்லையா?

# alreadyHaveAccount
source: Already have an account?
si: දැනටමත් ගිණුමක් තිබේද?
ta: ஏற்கனவே கணக்கு உள்ளதா?

# marketingTitle
source: Travel with Comfort & Style
si: සුවපහසුව සහ විලාසිතාව සමඟ ගමන් කරන්න
ta: வசதி மற்றும் பாணியுடன் பயணம் செய்யுங்கள்

# marketingSubtitle
source: Join thousands of satisfied travelers who trust BusLink for their daily commutes.
si: තම දෛනික ගමන් සඳහා BusLink විශ්වාස කරන දහස් ගණනක් තෘප්තිමත් මගීන් සමඟ එක්වන්න.
ta: தங்கள் தினசரி பயணங்களுக்கு BusLink ஐ நம்பும் ஆயிரக்கணக்கான திருப்தியடைந்த பயணிகளுடன் இணையுங்கள்.

source: My Trips
si: මගේ ගමන්
ta: எனது பயணங்கள்

source: Favorites
si: ප්‍රියතමයන්
ta: விருப்பங்கள்

source: Admin Preview
si: පරිපාලක පෙරදසුන
ta: நிர்வாகி முன்னோட்டம்

source: Exit Preview
si: පෙරදසුනින් ඉවත් වන්න
ta: முன்னோட்டத்திலிருந்து வெளியேறு

source: New Notification
si: නව දැනුම්දීමක්
ta: புதிய அறிவிப்பு

source: VIEW
si: බලන්න
ta: பார்வை

source: Find Trips
si: ගමන් සොයන්න
ta: பயணங்களைக் கண்டறியவும்

source: Select Date
si: දිනය තෝරන්න
ta: தேதியைத் தேர்ந்தெடுக்கவும்

source: No Routes Found
si: මාර්ග හමු නොවීය
ta: வழிகள் எதுவும் இல்லை

# adjustFilters
source: Adjust filters to see results
si: ප්‍රතිඵල බැලීමට පෙරහන් සකසන්න
ta: முடிவுகளைக் காண வடிப்பான்களைச் சரிசெய்யவும்

source: Preview App
si: යෙදුම පෙරදසුන් කරන්න
ta: பயன்பாட்டு முன்னோட்டம்

# navHome
source: Home
si: මුල් පිටුව
ta: முகப்பு

# navMyTrips
source: My Trips
si: මගේ ගමන්
ta: எனது பயணங்கள்

# navFavorites
source: Favorites
si: ප්‍රියතමයන්
ta: விருப்பங்கள்

# navProfile
source: Profile
si: පැතිකඩ
ta: சுயவிவரம்

# navSupport
source: Support
si: සහාය
ta: ஆதரவு

# navLogin
source: Login
si: පිවිසෙන්න
ta: உள்நுழைக

# navLogout
source: Log Out
si: ඉවත් වන්න
ta: வெளியேறு

# heroSubtitle1
source: Book your bus tickets instantly with BusLink. Reliable, fast, and secure.
si: BusLink සමඟ ක්ෂණිකව බස් ටිකට් පත් වෙන්කරවා ගන්න. විශ්වාසදායක, වේගවත් සහ ආරක්ෂිතයි.
ta: BusLink மூலம் உடனடியாக பேருந்து டிக்கெட்டுகளை பதிவு செய்யுங்கள். நம்பகமான, வேகமான மற்றும் பாதுகாப்பான.

# heroSubtitle2
source: Discover the most beautiful routes across the island in comfort.
si: දිවයින පුරා අලංකාර මාර්ග සුවපහසුවෙන් ගමන් කරන්න.
ta: தீவு முழுவதும் உள்ள அழகான வழித்தடங்களை வசதியாக கண்டறியுங்கள்.

# heroSubtitle3
source: Seamless payments and real-time tracking for your journey.
si: ඔබගේ ගමන සඳහා පහසු ගෙවීම් සහ තථ්‍ය කාලීන නිරීක්ෂණය.
ta: உங்கள் பயணத்திற்கான எளிய கட்டணங்கள் மற்றும் நிகழ்நேர கண்காணிப்பு.

# greetingMorning
source: Good Morning
si: සුභ උදෑසනක්
ta: காலை வணக்கம்

# greetingAfternoon
source: Good Afternoon
si: සුභ දහවල් කාලයක්
ta: மதிய வணக்கம்

# greetingEvening
source: Good Evening
si: සුභ සන්ධ්‍යාවක්
ta: மாலை வணக்கம்

source: Conductor Dashboard
si: කොන්දොස්තර ඩෑෂ්බෝඩ්
ta: நடத்துனர் டாஷ்போர்டு

source: Scan Ticket
si: ටිකට් පත ස්කෑන් කරන්න
ta: டிக்கெட்டை ஸ்கேன் செய்யவும்

# scanTicketSubtitle
source: Scan a passenger ticket to verify boarding
si: ගොඩවීම තහවුරු කිරීමට මගී ටිකට් පත ස්කෑන් කරන්න
ta: ஏறுவதை உறுதிப்படுத்த பயணிகள் டிக்கெட்டை ஸ்கேன் செய்யவும்

source: Manual Ticket ID
si: අතින් ටිකට් අංකය
ta: கையேடு டிக்கெட் எண்

source: Use Camera
si: කැමරාව භාවිතා කරන්න
ta: கேமராவைப் பயன்படுத்தவும்

source: Verify
si: තහවුරු කරන්න
ta: சரிபார்க்கவும்

source: Search Trips
si: ගමන් සොයන්න
ta: பயணங்களைத் தேடுங்கள்

source: Live Journey
si: සජීවී ගමන
ta: நேரடி பயணம்

source: Your bus is here
si: ඔබේ බසය පැමිණ ඇත
ta: உங்கள் பேருந்து இங்கே உள்ளது

source: TRACK NOW
si: දැන් නිරීක්ෂණය කරන්න
ta: இப்போது கண்காணிக்கவும்

source: Company
si: ආයතනය
ta: நிறுவனம்

source: About Us
si: අප ගැන
ta: எங்களைப் பற்றி

source: Careers
si: රැකියා
ta: வேலைவாய்ப்புகள்

source: Blog
si: බ්ලොග්
ta: வலைப்பதிவு

source: Partners
si: හවුල්කරුවන්
ta: பங்குதாரர்கள்

source: Support
si: සහාය
ta: ஆதரவு

source: Help Center
si: සහාය මධ්‍යස්ථානය
ta: உதவி மையம்

source: Terms of Service
si: සේවා කොන්දේසි
ta: சேவை விதிமுறைகள்

source: Privacy Policy
si: රහස්‍යතා ප්‍රතිපත්තිය
ta: தனியுரிமைக் கொள்கை

source: FAQs
si: නිතර අසන ප්‍රශ්න
ta: கேள்வி பதில்கள்

source: Contact
si: සම්බන්ධ වන්න
ta: தொடர்பு

# rightsReserved
source: Â© 2024 BusLink. All rights reserved.
si: © 2024 BusLink. සියලුම හිමිකම් ඇවිරිණි.
ta: © 2024 BusLink. அனைத்து உரிமைகளும் பாதுகாக்கப்பட்டவை.

# madeWithLove
source: Made with love in Sri Lanka
si: ශ්‍රී ලංකාවේ ආදරයෙන් නිපදවන ලදී
ta: இலங்கையில் அன்புடன் தயாரிக்கப்பட்டது

source: Upcoming Trip
si: ඉදිරි ගමන
ta: வரவிருக்கும் பயணம்

source: Arriving in
si: පැමිණීමට නියමිත කාලය
ta: வருகிறது

source: Bus No
si: බස් අංකය
ta: பேருந்து எண்

source: Origin
si: ආරම්භය
ta: ஆரம்பம்

source: Destination
si: ගමනාන්තය
ta: சேருமிடம்

source: Seats
si: ආසන
ta: இருக்கைகள்

source: Price Paid
si: ගෙවූ මුදල
ta: செலுத்திய தொகை

# statusActive
source: Active
si: ක්‍රියාකාරී
ta: செயலில்

# statusDelayed
source: Delayed
si: ප්‍රමාදයි
ta: தாமதமானது

# statusCancelled
source: Cancelled
si: අවලංගු කරන ලදී
ta: ரத்து செய்யப்பட்டது

# statusCompleted
source: Completed
si: නිම කරන ලදී
ta: முடிந்தது

# statusScheduled
source: Scheduled
si: නියමිතයි
ta: திட்டமிடப்பட்டது

# tabUpcoming
source: UPCOMING
si: ඉදිරි
ta: வரவிருக்கும்

# tabCompleted
source: COMPLETED
si: නිම කළ
ta: முடிந்தவை

# tabCancelled
source: CANCELLED
si: අවලංගු කළ
ta: ரத்து செய்யப்பட்டவை

# tabDelayed
source: DELAYED
si: ප්‍රමාද වූ
ta: தாமதமானவை

source: VIEW TICKET
si: ටිකට් පත බලන්න
ta: டிக்கெட்டைப் பாருங்கள்

source: Refund
si: ආපසු ගෙවීම
ta: திரும்பப்பெறுதல்
